{
  "branches": {
    "electromagnetism": "Electromagnetism",
    "mechanics": "Mechanics",
    "optics": "Optics",
    "thermodynamics": "Thermodynamics"
  },
  "experiments": {
    "circuit_overload": {
      "name": "Circuit overload",
      "description": ""
    },
    "convection": {
      "name": "Convection",
      "description": ""
    },
    "diffraction": {
      "name": "Diffraction",
      "description": ""
    },
    "elastic_collision": {
      "name": "Elastic collision",
      "description": "An elastic two-body collision is a collision between two bodies. When the bodies collide, they exchange energy and momentum. After the collision, they move with velocities that differ in direction and magnitude from their velocities before the collision. In a head-on central collision, the centers of masses of both bodies move along the same line.\nF = ma - gravity\nP = mu - momentum\nm1u1+m2u2=m1u’1+m2u’2 - from the law of conservation of momentum"
    },
    "electrical_short": {
      "name": "Electrical short",
      "description": ""
    },
    "electricity": {
      "name": "Electricity",
      "description": ""
    },
    "expansion": {
      "name": "Expansion",
      "description": ""
    },
    "gravitation": {
      "name": "Gravitation",
      "description": ""
    },
    "gyroscope": {
      "name": "Gyroscope",
      "description": "Gyroscope is a device capable of responding to changes in the angles of orientation of the body on which it is mounted relative to the inertial reference frame. The simplest example of a gyroscope is a yula. Among the mechanical gyroscopes stands out rotor gyroscope - a rapidly rotating solid body (rotor), whose axis of rotation can freely change orientation in space. In this case, the rate of rotation of the gyroscope significantly exceeds the rate of rotation of its axis of rotation. The main property of such a gyroscope is the ability to maintain in space the unchanged direction of the axis of rotation in the absence of influence of external force moments on it and effectively resist the action of external force moments. This property is largely determined by the magnitude of the angular velocity of the gyroscope's own rotation."
    },
    "heat_exchange": {
      "name": "Heat exchange",
      "description": ""
    },
    "inelastic_collision": {
      "name": "Inelastic collision",
      "description": "Inelastic collision is such a collision, as a result of which the internal energy of the flying particles or one of them changes and, consequently, the total kinetic energy of the system changes.\nm1u1 + m2u2 = (m1 + m2)u - law of conservation of momentum\nv’ = (m1u1 + m2u2)/(m1 + m2) - velocity"
    },
    "interference": {
      "name": "Interference",
      "description": ""
    },
    "oscillation": {
      "name": "Oscillation",
      "description": "Oscillations of a mathematical pendulum — Oscillator, which is a mechanical system consisting of a material point at the end of a weightless, inextensible thread or light rod and located in a homogeneous field of gravitational forces. The other end of the thread is usually stationary. The period of small natural oscillations of a pendulum of length L suspended in the field of gravity is equal and does not depend, to a first approximation, on the amplitude of oscillations and mass of the pendulum. Here g is the acceleration of free fall.\nT = t/N T is the period\nν = N/t = 1/T ν - frequency\nx = xmaxcos(2πνt) - coordinate at time t [m]\nφ =2πνt - phase [rad]\nT = 2π√(l/g) - period"
    },
    "point_light_source": {
      "name": "Point light source",
      "description": ""
    },
    "pull": {
      "name": "Pull",
      "description": "Attraction — The forces of interaction between point stationary charges obey Newton's third law, and are forces of attraction to each other at different signs. The interaction of stationary electric charges is called electrostatic or Coulomb interaction.\nF = k * |q1| * |q2| / r^2"
    },
    "real_light_source": {
      "name": "Real light source",
      "description": ""
    },
    "reflection": {
      "name": "Reflection",
      "description": ""
    },
    "refraction": {
      "name": "Refraction",
      "description": ""
    },
    "repulsion": {
      "name": "Repulsion",
      "description": ""
    },
    "sliding_friction": {
      "name": "Sliding friction",
      "description": "Sliding friction force is a force that arises between contacting bodies during their relative motion.\nThe value characterizing the rubbing surfaces is called the coefficient of friction and is usually denoted by the Latin letter k or the Greek letter μ. It depends on the nature and quality of processing of the rubbing surfaces. In addition, the coefficient of friction depends on velocity. In a horizontal plane, the friction force can be found by the formula:\nF=μ*N\nμ is the coefficient of sliding friction,\nN is the force of the normal reaction of the support."
    },
    "static_electricity": {
      "name": "Static electricity",
      "description": ""
    },
    "thermal_conductivity": {
      "name": "Thermal conductivity",
      "description": ""
    },
    "thermal_radiation": {
      "name": "Thermal radiation",
      "description": ""
    },
    "thermal_transition": {
      "name": "Thermal transition",
      "description": ""
    }
  },
  "settings": {},
  "screens": {
    "home": {
      "heading": "Welcome to VisualPhysics",
      "subheading": "Choose the branch you want"
    },
    "experiments": {
      "heading": "Select experiment",
      "unknownBranchSubheading": "Failed to find the `{branch}` branch"
    },
    "experiment": {
      "unknownBranchHeading": "Failed to find the `{branch}` branch",
      "unknownExperimentHeading": "Failed to find the `{experiment}` experiment in the `{branch}` branch",
      "noDetailsSubheading": "We don't know enough about this experiment",
      "noDescriptionSubheading": "There are no details for this experiment",
      "noVisualisationSubheading": "There is no visualisation for this experiment"
    }
  },
  "back": "Back",
  "repeat": "Repeat"
}
