{
  "branches": {
    "electromagnetism": "Электромагнетизм",
    "mechanics": "Механика",
    "optics": "Оптика",
    "thermodynamics": "Термодинамика"
  },
  "experiments": {
    "circuit_overload": {
      "name": "Перегрузка цепи",
      "description": "Перегрузка цепи — это явление увеличения силы тока при параллельном подключении большого колличества потребителей тока. В большинстве случаев сопровождается большим нагреваеием, коротким замыканием и разрушением цепи."
    },
    "convection": {
      "name": "Конвекция",
      "description": "Конвекция — вид теплообмена (теплопередачи), при котором внутренняя энергия передаётся вместе с веществом. Существует так называемая естественная конвекция, которая возникает в веществе самопроизвольно при его неравномерном нагревании в поле тяготения. При такой конвекции нижние слои вещества нагреваются, становятся легче и всплывают, а верхние слои, наоборот, остывают, становятся тяжелее и опускаются вниз, после чего процесс повторяется снова и снова."
    },
    "diffraction": {
      "name": "Дифракция",
      "description": "Дифракция — явления, наблюдаемые при прохождении волн мимо края препятствия, связанные с отклонением волн от прямолинейного распространения при взаимодействии с препятствием."
    },
    "elastic_collision": {
      "name": "Упругое столкновение тел",
      "description": "Упругое столкновения двух тел — это столкновение двух тел. При соприкосновении тела обмениваются энергией и импульсом. После соударения они двигаются со скоростями, которые отличаются по направлению и величине от их скоростей до столкновения. При лобовом центральном соударении центры масс обоих тел двигаются вдоль одной линии.\nF = ma - сила тяжести\nP = mu – импульс\nm1u1+m2u2=m1u’1+m2u’2 – из закона сохранения импульса"
    },
    "electrical_short": {
      "name": "Короткое замыкание",
      "description": "Кортокое замыкание — явление резкого увеличения значения электрического тока в цепи вследствие уменьшения внешнего сопротивления до нуля. Ток короткого замыкания прямо пропорционален ЭДС цепи и обратно пропорционален внутреннему сопротивлению ЭДС."
    },
    "electricity": {
      "name": "Электрический ток в цепи",
      "description": "Ход тока в цепи — наличие тока в цепи обусловлено направленным перемещением заряженных частиц. В твердых телах течение тока создается движением отрицательно заряженных электронов, в газах и жидкостях – положительными ионами. В таких широко распространенных веществах, как полупроводники, электрический ток возникает при движении частиц – электронов и положительно заряженных частиц."
    },
    "expansion": {
      "name": "Объемное расширение",
      "description": "Объемное расширение твердых тел характеризуется температурным коэффициентом объемного расширения β — величиной, равной отношению относительного увеличения объема ∆V/V тела к изменению температуры ∆Т\nV= V (1+ β ⋅ Δ T)"
    },
    "gravitation": {
      "name": "Гравитация",
      "description": "Гравитация — универсальное фундаментальное взаимодействие между материальными телами, обладающими массой. В приближении малых по сравнению со скоростью света скоростей и слабого гравитационного взаимодействия описывается теорией тяготения Ньютона, в общем случае описывается общей теорией относительности Эйнштейна.\nF  = Gm1m2 / r2 – закон всемирного тяготения."
    },
    "gyroscope": {
      "name": "Гироскоп",
      "description": "Гироскоп — устройство, способное реагировать на изменение углов ориентации тела, на котором оно установлено, относительно инерциальной системы отсчёта. Простейший пример гироскопа — юла. Среди механических гироскопов выделяется роторный гироскоп — быстро вращающееся твёрдое тело (ротор), ось вращения которого может свободно изменять ориентацию в пространстве. При этом скорость вращения гироскопа значительно превышает скорость поворота оси его вращения. Основное свойство такого гироскопа — способность сохранять в пространстве неизменное направление оси вращения при отсутствии воздействия на него моментов внешних сил и эффективно сопротивляться действию внешних моментов сил. Это свойство в значительной степени определяется величиной угловой скорости собственного вращения гироскопа."
    },
    "heat_exchange": {
      "name": "Теплообмен",
      "description": "Теплообмен — это процесс изменения внутренней энергии без совершения работы над телом или самим телом. Теплообмен всегда происходит в определенном направлении: от тел с более высокой температурой к телам с более низкой. Когда температуры тел выравниваются, теплообмен прекращается. Теплообмен может осуществляться тремя способами: теплопроводностью, конвекцией и излучением.\nQ = cm(t2 - t1)"
    },
    "inelastic_collision": {
      "name": "Неупругое столкновение тел",
      "description": "Неупругое столкновение — это такое столкновение, в результате которого внутренняя энергия разлетающихся частиц или же одной из них изменяется, а, следовательно, изменяется и суммарная кинетическая энергия системы.\nm1u1 + m2u2 = (m1 + m2)u – закон сохранения импульса\nv’ = (m1u1 + m2u2)/(m1 + m2) – скорость"
    },
    "interference": {
      "name": "Интерференция",
      "description": "Интерференция — взаимное увеличение или уменьшение результирующей амплитуды двух или нескольких когерентных волн при их наложении друг на друга. Интерференция света — частный случай интерференции для видимой области электромагнитного спектра."
    },
    "oscillation": {
      "name": "Колебание маятника",
      "description": "Колебания математического маятника — Осциллятор, представляющий собой механическую систему, состоящую из материальной точки на конце невесомой нерастяжимой нити или лёгкого стержня и находящуюся в однородном поле сил тяготения. Другой конец нити обычно неподвижен. Период малых собственных колебаний маятника длины L, подвешенного в поле тяжести, равен и не зависит, в первом приближении, от амплитуды колебаний и массы маятника. Здесь g - ускорение свободного падения.\nT = t/N T - период\nν = N/t = 1/T ν - частота\nx = xmaxcos(2πνt) - координата в момент времени t [м]\nφ =2πνt - фаза [рад]\nT = 2π√(l/g) – период"
    },
    "point_light_source": {
      "name": "Точечный источник света",
      "description": "В однородной среде свет распространяется прямолинейно. Однородная среда — это среда, состоящая из одного и того же вещества, например, воздух, вода, стекло, масло и пр. Наблюдать прямолинейное распространение света можно в затемненной комнате, в которую через небольшое отверстие проникает луч света."
    },
    "pull": {
      "name": "Притяжение",
      "description": "Притяжение — Силы взаимодействия точечных неподвижных зарядов подчиняются третьему закону Ньютона, и являются силами притяжения друг к другу при разных знаках. Взаимодействие неподвижных электрических зарядов называют электростатическим или кулоновским взаимодействием.\nF = k * |q1| * |q2| / r^2"
    },
    "real_light_source": {
      "name": "Реальный источник света",
      "description": "Реальные источники света — это природные материальные объекты и явления, основным или вторичным свойством которых является способность испускать видимый свет. Одной из отличительный черт Реального источника света по сравению с точеченым является, наличие полутени при освещении некого объекта."
    },
    "reflection": {
      "name": "Отражение",
      "description": "Отражение — физический процесс взаимодействия волн или частиц с поверхностью, изменение направления волнового фронта на границе двух сред с разными свойствами, в котором волновой фронт возвращается в среду, из которой он пришёл. Одновременно с отражением волн на границе раздела сред, как правило, происходит преломление волн.\nЗакон отражения света - Угол падения равен углу отражения. Падающий луч, луч отраженный и перпендикуляр, восстановленный в точке падения, лежат в одной плоскости."
    },
    "refraction": {
      "name": "Преломление",
      "description": "Преломление — изменение направления луча, возникающее на границе двух сред, через которые этот луч проходит, или в одной среде, но с меняющимися свойствами, в которой скорость распространения волны неодинакова."
    },
    "repulsion": {
      "name": "Отталкивание",
      "description": "Отталкивание — если тела имеют одноименные заряды, силы, действующие на них, будут отталкивающими."
    },
    "sliding_friction": {
      "name": "Сила трения скольжения",
      "description": "Сила трения скольжения — сила, возникающая между соприкасающимися телами при их относительном движении.\nВеличина, характеризующая трущиеся поверхности, называется коэффициентом трения, и обозначается обычно латинской буквой k или греческой буквой μ. Она зависит от природы и качества обработки трущихся поверхностей. Кроме того, коэффициент трения зависит от скорости. В горизонтальной плоскости силу трения можно найти по формуле:\nF=μ*N\nμ — коэффициент трения скольжения,\nN — сила нормальной реакции опоры."
    },
    "static_electricity": {
      "name": "Статическое электричество",
      "description": "Статическое эллектричество — совокупность явлений, связанных с возникновением, сохранением и релаксацией свободного электрического заряда на поверхности или в объёме диэлектриков или на изолированных проводниках.Фактически атомы и молекулы одного вещества, обладающие более сильным притяжением, отрывают электроны от другого вещества, создавая вихревое движение ионов среды, в которой они заключены.\n"
    },
    "thermal_conductivity": {
      "name": "Теплопроводность",
      "description": "Теплопрово́дность — способность материальных тел проводить тепловую энергию от более нагретых частей тела к менее нагретым частям тела путём хаотического движения частиц тела (атомов, молекул, электронов и т. п.). Такой теплообмен может происходить в любых телах с неоднородным распределением температур.\nРасммотрим опыт, который наглядно демонстрирует теплопроводность металлов. На штанге произвольно закреплен алюминеевый стержень. На стрежне при помощи воска закреплены стрелки. К краю стержня подносится нагреватель. В ходе процесс стержень постепенно нагревается, воск тает и поосередно стрелки начинают падать."
    },
    "thermal_radiation": {
      "name": "Излучение тепла",
      "description": "Тепловое излучение — это электромагнитное излучение, испускаемое веществом за счет запасов его внутренней (тепловой) энергии. Поэтому характеристики теплового излучения (интенсивность, спектральный состав) зависят от температуры излучающего вещества."
    },
    "thermal_transition": {
      "name": "Переход работы в теплоту",
      "description": "Переход работы в теплоту — по первому закону термодинамики изменение Δ внутренней энергии неизолированной термодинамической системы равно разности между количеством теплоты, переданной системе, и работой, совершенной системой над внешними телами.\nΔU = A + Q"
    }
  },
  "settings": {},
  "screens": {
    "home": {
      "heading": "Добро пожаловать в VisualPhysics",
      "subheading": "Выберите интересующий раздел"
    },
    "experiments": {
      "heading": "Выберите эксперимент",
      "unknownBranchSubheading": "Не удалось найти раздел `{branch}`"
    },
    "experiment": {
      "unknownBranchHeading": "Не удалось найти раздел `{branch}`",
      "unknownExperimentHeading": "Не удалось найти эксперимент `{experiment}` в разделе `{branch}`",
      "noDetailsSubheading": "Мы недостаточно знаем об этом эксперименте",
      "noDescriptionSubheading": "Для этого эксперимента нет подробностей",
      "noVisualisationSubheading": "Для этого эксперимента нет визуализации"
    }
  },
  "back": "Назад",
  "repeat": "Повторить"
}
